jackadam1981/ChromeEc/chip/stm32/registers-stm32l5.bak.h
/* Copyright 2021 The Chromium OS Authors. All rights reserved.
 * Use of this source code is governed by a BSD-style license that can be
 * found in the LICENSE file.
 */

/**
 * @file
 * @brief Register map for the STM32L4 family of chips
 *
 * This header file should not be included directly.
 * Please include registers.h instead.
 *
 * Known Chip Variants
 * - STM32L552
 */

#ifndef __CROS_EC_REGISTERS_H
#error "This header file should not be included directly."
#endif

/* --- IRQ numbers --- */
#define STM32_IRQ_WWDG             0
#define STM32_IRQ_PVD              1
#define STM32_IRQ_FLASH            6
#define STM32_IRQ_FLASH_S          7
#define STM32_IRQ_RCC              9
#define STM32_IRQ_RCC_S           10
#define STM32_IRQ_EXTI0           11
#define STM32_IRQ_EXTI1           12
#define STM32_IRQ_EXTI2           13
#define STM32_IRQ_EXTI3           14
#define STM32_IRQ_EXTI4           15
#define STM32_IRQ_EXTI5           16
#define STM32_IRQ_EXTI6           17
#define STM32_IRQ_EXTI7           18
#define STM32_IRQ_EXTI8           19
#define STM32_IRQ_EXTI9           20
#define STM32_IRQ_EXTI10          21
#define STM32_IRQ_EXTI11          22
#define STM32_IRQ_EXTI12          23
#define STM32_IRQ_EXTI13          24
#define STM32_IRQ_EXTI14          25
#define STM32_IRQ_EXTI15          26
#define STM32_IRQ_DMAMUX_OVR      27
#define STM32_IRQ_DMAMUX_OVR_S    28
#define STM32_IRQ_DMA_CHANNEL_1   29
#define STM32_IRQ_DMA_CHANNEL_2   30
#define STM32_IRQ_DMA_CHANNEL_3   31
#define STM32_IRQ_DMA_CHANNEL_4   32
#define STM32_IRQ_DMA_CHANNEL_5   33
#define STM32_IRQ_DMA_CHANNEL_6   34
#define STM32_IRQ_DMA_CHANNEL_7   35
#define STM32_IRQ_DMA_CHANNEL_8   36
#define STM32_IRQ_ADC1            37
#define STM32_IRQ_TIM1_BRK        41
#define STM32_IRQ_TIM1_UP         42
#define STM32_IRQ_TIM1_TRG_COM    43
#define STM32_IRQ_TIM1_CC         44
#define STM32_IRQ_TIM2            45
#define STM32_IRQ_TIM3            46
#define STM32_IRQ_TIM4            47
#define STM32_IRQ_TIM5            48
#define STM32_IRQ_TIM6            49
#define STM32_IRQ_TIM7            50
#define STM32_IRQ_TIM8_BRK        51
#define STM32_IRQ_TIM8_UP         52
#define STM32_IRQ_TIM8_TRG_COM    53
#define STM32_IRQ_TIM8_CC         54
#define STM32_IRQ_I2C1_EV         55
#define STM32_IRQ_I2C1_ER         56
#define STM32_IRQ_I2C2_EV         57
#define STM32_IRQ_I2C2_ER         58
#define STM32_IRQ_SPI1            59
#define STM32_IRQ_SPI2            60
#define STM32_IRQ_USART1          61
#define STM32_IRQ_USART2          62
#define STM32_IRQ_USART3          63
#define STM32_IRQ_USART4          64
#define STM32_IRQ_USART5          65
#define STM32_IRQ_LPUART          66
#define STM32_IRQ_LPTIM1          67
#define STM32_IRQ_LPTIM2          68
#define STM32_IRQ_TIM15           69
#define STM32_IRQ_TIM16           70
#define STM32_IRQ_TIM17           71
#define STM32_IRQ_COMP            72
#define STM32_IRQ_USB_FS          73
#define STM32_IRQ_CRS             74
#define STM32_IRQ_FMC             75
#define STM32_IRQ_DMA2_CHANNEL1   80
#define STM32_IRQ_DMA2_CHANNEL2   81
#define STM32_IRQ_DMA2_CHANNEL3   82
#define STM32_IRQ_DMA2_CHANNEL4   83
#define STM32_IRQ_DMA2_CHANNEL5   84
#define STM32_IRQ_DMA2_CHANNEL6   85
#define STM32_IRQ_DMA2_CHANNEL7   86
#define STM32_IRQ_DMA2_CHANNEL8   87

/* To simplify code generation, define DMA channel 9..16 */
#define STM32_IRQ_DMA_CHANNEL_9    STM32_IRQ_DMA2_CHANNEL1
#define STM32_IRQ_DMA_CHANNEL_10   STM32_IRQ_DMA2_CHANNEL2
#define STM32_IRQ_DMA_CHANNEL_11   STM32_IRQ_DMA2_CHANNEL3
#define STM32_IRQ_DMA_CHANNEL_12   STM32_IRQ_DMA2_CHANNEL4
#define STM32_IRQ_DMA_CHANNEL_13   STM32_IRQ_DMA2_CHANNEL5
#define STM32_IRQ_DMA_CHANNEL_14   STM32_IRQ_DMA2_CHANNEL6
#define STM32_IRQ_DMA_CHANNEL_15   STM32_IRQ_DMA2_CHANNEL7
#define STM32_IRQ_DMA_CHANNEL_16   STM32_IRQ_DMA2_CHANNEL8

/* aliases for easier code sharing */
#define STM32_IRQ_I2C1 STM32_IRQ_I2C1_EV
#define STM32_IRQ_I2C2 STM32_IRQ_I2C2_EV
#define STM32_IRQ_I2C3 STM32_IRQ_I2C3_EV
#define STM32_IRQ_USB_LP STM32_IRQ_USB_FS



/* Peripheral base addresses */
/*#define STM32_ADC1_BASE             0x40012400*/
#define STM32_ADC_BASE              0x40028000

//#define STM32_CRC_BASE              0x40023000
//#define STM32_DAC_BASE              0x40007400
#if 0


#define STM32_DBGMCU_BASE           0xE0042000
#endif

//#define STM32_DMA1_BASE             0x40020000
//#define STM32_DMA2_BASE             0x40020400

//#define STM32_EXTI_BASE             0x4002f400

//#define STM32_FLASH_REGS_BASE       0x40022000
//#define STM32_GPIOA_BASE            0x42020000
//#define STM32_GPIOB_BASE            0x42020400
//#define STM32_GPIOC_BASE            0x42020800
//#define STM32_GPIOD_BASE            0x42020C00
//#define STM32_GPIOE_BASE            0x42021000
//#define STM32_GPIOF_BASE            0x42021400
//#define STM32_GPIOG_BASE            0x42021800
//#define STM32_GPIOH_BASE            0x42021C00
//#define STM32_I2C1_BASE             0x40005400
//#define STM32_I2C2_BASE             0x40005800
//#define STM32_I2C3_BASE             0x40005C00
//#define STM32_I2C4_BASE             0x40008400

//#define STM32_IWDG_BASE             0x40003000
#if 0
#define STM32_LCD_BASE              0x40002400

#define STM32_OPTB_BASE             0x1FFF7800

#define STM32_PMSE_BASE             0x40013400
#endif
//#define STM32_PWR_BASE              0x40007000

//#define STM32_RCC_BASE              0x40021000
//#define STM32_RNG_BASE              0x420C4000
//#define STM32_RTC_BASE              0x40002800

//#define STM32_SPI1_BASE             0x40013000
//#define STM32_SPI2_BASE             0x40003800
//#define STM32_SPI3_BASE             0x40003c00

//#define STM32_SYSCFG_BASE           0x40010000

//#define STM32_TIM1_BASE             0x40012c00
//#define STM32_TIM2_BASE             0x40000000
//#define STM32_TIM3_BASE             0x40000400
//#define STM32_TIM4_BASE             0x40000800
//#define STM32_TIM5_BASE             0x40000c00
//#define STM32_TIM6_BASE             0x40001000
//#define STM32_TIM7_BASE             0x40001400
//#define STM32_TIM8_BASE             0x40013400
//#define STM32_TIM15_BASE            0x40014000
//#define STM32_TIM16_BASE            0x40014400
//#define STM32_TIM17_BASE            0x40014800

